author = "Куприн Артём Владимирович"

# Задача-1:
# Дан список фруктов.
# Напишите программу, выводящую фрукты в виде нумерованного списка,
# выровненного по правой стороне.

# Пример:
# Дано: ["яблоко", "банан", "киви", "арбуз"]
# Вывод:
# 1. яблоко
# 2.  банан
# 3.   киви
# 4.  арбуз
# Подсказка: воспользоваться методом .format()

fruits = ["яблоко", "банан", "киви", "арбуз"]
i = 0
for step in fruits:
    i = i + 1
    print('{}. {:>6}'.format(i, step))


# Задача-2:
# Даны два произвольные списка.
# Удалите из первого списка элементы, присутствующие во втором списке.

# Немного странно описано задание "Два произвольных списка" ,не понятно input или random или..много вариаций решений
# Я понял это задание так)
# Решил с помощью множеств

numbers = [1, 2, 3, 4, 5, 6, 7, 8]
another_numbers = [3, 4, 5, 7, 2]
print('\nДано: \n{},\n{},'.format(numbers, another_numbers))
total = []
list_of_numbers = set(numbers) - set(another_numbers)
print('Итог:')
for step in list_of_numbers:
        total.append(step)
print(total)





# Задача-3:
# Дан произвольный список из целых чисел.
# Получите НОВЫЙ список из элементов исходного, выполнив следующие условия:
# если элемент кратен двум, то разделить его на 4, если не кратен, то умножить на два.


print("\nЗадание 3\n")

numbers = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10]
total = []
print('Было {}'.format(numbers))
for i in numbers:
    if i % 2 == 0:
        total.append(i/4)
    else:
        total.append(i*2)
print('Стало {}'.format(total))
# Простенько получилось,ну а зачем усложнять :D

